/*В качестве параметра метод принимает строку, в которой записано название дня недели.
Необходимо реализовать метод таким образом, чтобы он выводил на экран название переданного в него дня и всех
последующих до конца недели дней. Если в качестве строки передан не день,
то выводится текст “это не день недели”. Первый день понедельник, последний –
воскресенье. Вместо if в данной задаче используйте switch.
Обратите внимание, что делать для каждого из case вывод сразу всех дней (например case “понедельник”
sout(“понедельник вторник среда четверг пятница суббота воскресенье”) – решение явно
некорректное. Попробуйте применить для решения задачи принцип падения сквозь метки.*/
public class Condition_12 {
    public static void main(String[] args) {
        printDays("четверг");
        printDays("чг");
    }
    public static void printDays(String x) {
        switch (x) {
            case "понедельник":
                System.out.print("понедельник ");
            case "вторник":
                System.out.print("вторник ");
            case "среда":
                System.out.print("среда ");
            case "четверг":
                System.out.print("четверг ");
            case "пятница":
                System.out.print("пятница ");
            case "суббота":
                System.out.print("суббота ");
            case "воскресенье":
                System.out.print("воскресенье");
                break;
            default:
                System.out.print("это не день недели");
        }
        System.out.println();
    }
}