/*Необходимо реализовать метод таким образом, чтобы он возвращал строку,
в которой сначала будет число х, а затем одно из слов:
Слово “год” добавляется, если число х заканчивается на 1, кроме чисел оканчивающихся на 11.
Слово “года” добавляется, если число х заканчивается на 2, 3 или 4, кроме чисел оканчивающихся на 12, 13, 14.
Слово “лет” добавляется во всех остальных случаях.
Подсказка: оператор % позволяет получить остаток от деления.*/
public class Condition_10 {
    public static void main(String[] args) {
        System.out.println(age(5));
        System.out.println(age(31));
        System.out.println(age(44));
    }
    public static String age(int x) {
        int ld = x % 10;
        int ltd = x % 100;

        if (ld == 1 && ltd != 11)
            return x + " год";
        else if ((ld == 2 || ld == 3 || ld == 4) && (ltd < 12 || ltd > 14))
            return x + " года";
        else
            return x + " лет";
    }
}
