/*
Создайте класс Дробь (Fraction) со следующими особенностями:

Имеет числитель (numerator): целое число
Имеет знаменатель (denominator): целое число
Дробь может быть создана с указанием числителя и знаменателя
Объекты дробей не могут изменять свое состояние
Для числителя задать отрицательное значение можно, в этом случае вся дробь считается отрицательной
Для знаменателя отрицательное значение недопустимо
Может вернуть строковое представление вида “числитель/знаменатель” (toString)
Может выполнять операции сложения, вычитания с другой Дробью или целым числом. Результатом операции должна быть новая Дробь
Затем необходимо выполнить следующие задачи:

Создать несколько экземпляров дробей
Посчитать f1.sum(f2).sum(f3).minus(5), где f1 это одна треть, f2 две пятых, а f3 это семь восьмых
*/
public class OOP_5_1 {
    public static void main(String[] args) {
        // Создание экземпляров дробей
        Fraction1 f1 = new Fraction1(1, 3);   // одна треть
        Fraction1 f2 = new Fraction1(2, 5);   // две пятых
        Fraction1 f3 = new Fraction1(7, 8);   // семь восьмых
        System.out.println(f1 + " " + f2 + " " + f3);
        Fraction1 result = f1.sum(f2).sum(f3);
        System.out.println(result);
        Fraction1 result1 = f1.sum(f2).sum(f3).minus(5);
        System.out.println(result1);
    }
}