/* ОБЪЯВЛЕНИЕ КЛАССА
Поля - Любое количество любых типов. Любые классы считаются ссылочными типами.
Конструктор - метод, который указывается после слова new. Конструкторы можно не писать, в этом
случае появится таковой без параметров. Написанный вручную заменяет его. Может
быть несколько конструкторов.
Методы статические методы видят только статические поля. Обычные методы видят любые поля.
class Имя_класса {
    тип имя_поля;
    //любое количество полей

    Имя_класса(параметры) {
        тело_конструктора;
        // специальный метод — конструктор
        // вызывается после операции new
    }
    тип имя_метода(параметры) {
        тело_метода
    }
}
 */
class Structura {

    String str;                     // Поля

    public Structura(String str) {
        this.str = str;             // Конструктор
    }

    @Override
    public String toString() {
        return "A{" +                   // Методы
                "str='" + str + '\'' +
                '}';
    }
}

